app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "134"], ["text", "321"], ["created_at", "2015-07-21 03:30:34.592191"], ["updated_at", "2015-07-21 03:30:34.592191"]]
---
	def create
		#render plain: params[:article].inspect
		#@article = Article.new(params[:article])
		@article = Article.new(article_params)

		if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "13"], ["updated_at", "2015-07-17 03:09:03.722555"], ["id", 6]]
---
	def update
	  @article = Article.find(params[:id])

	  if @article.update(article_params)